In [1]:
import pandas as pd
import numpy as np

In [2]:
NameData=['Alice', 'Bob', 'Charlie', 'David', 'Eva']
MathData=[84, 55, 87, 58, 86]
ScienceData=[78, 74, 82, 90, 83]
HistoryData=[71, 70, 89, 97, 76]

In [3]:
data = {
    'Name':NameData,
    'Math':MathData,
    'Science':ScienceData,
    'History':HistoryData
}
df = pd.DataFrame(data)

In [4]:
df

      Name  Math  Science  History
0    Alice    84       78       71
1      Bob    55       74       70
2  Charlie    87       82       89
3    David    58       90       97
4      Eva    86       83       76

<hr>

## Filtering Data:

Try filtering the DataFrame to show only students who scored above a certain value in a particular subject (e.g., students who scored above 80 in Math).

In [5]:
df[df['Math']>=80]

      Name  Math  Science  History
0    Alice    84       78       71
2  Charlie    87       82       89
4      Eva    86       83       76

Experiment with filtering based on multiple conditions (e.g., students who scored above 70 in Math and above 60 in Science).

In [6]:
df[(df['Math']>70) & (df['Science']>60)]

      Name  Math  Science  History
0    Alice    84       78       71
2  Charlie    87       82       89
4      Eva    86       83       76

## Basic Statistics:

Compute descriptive statistics like mean, median, minimum, maximum scores for each subject.

In [7]:
stats_df=pd.DataFrame()

In [11]:
stats_df['Math']=df['Math'].describe()
stats_df['Science']=df['Science'].describe()
stats_df['History']=df['History'].describe()

In [14]:
stats_df

            Math   Science    History
count   5.000000   5.00000   5.000000
mean   74.000000  81.40000  80.600000
std    16.046807   5.98331  11.886968
min    55.000000  74.00000  70.000000
25%    58.000000  78.00000  71.000000
50%    84.000000  82.00000  76.000000
75%    86.000000  83.00000  89.000000
max    87.000000  90.00000  97.000000

Calculate the overall average score for each student and add it as a new column in the DataFrame.

In [16]:
df

      Name  Math  Science  History
0    Alice    84       78       71
1      Bob    55       74       70
2  Charlie    87       82       89
3    David    58       90       97
4      Eva    86       83       76

In [19]:
df['Average']=df[['Math', 'Science', 'History']].mean(axis=1)

In [22]:
df

      Name  Math  Science  History    Average
0    Alice    84       78       71  77.666667
1      Bob    55       74       70  66.333333
2  Charlie    87       82       89  86.000000
3    David    58       90       97  81.666667
4      Eva    86       83       76  81.666667